---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternVisible(System.Boolean)
source: html/4ac03f4b-48d6-76b1-2c0d-ffe52b83a580.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternVisible Method

Sets the visibility of the surface background fill pattern.

## Syntax (C#)
```csharp
public OverrideGraphicSettings SetSurfaceBackgroundPatternVisible(
	bool fillPatternVisible
)
```

## Parameters
- **fillPatternVisible** (`System.Boolean`) - Value of the visibility of the surface background fill pattern.

## Returns
Reference to the changed object.